run_cases/case07_acousticWaveSquareCylinder/constant/linearZone/sigma
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "constant/linearZone";
    object      sigma;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
102400
(
0.05
0.04915972422
0.04833381212
0.04752226372
0.046725079
0.04594225797
0.04517380063
0.04441970698
...
)
;

boundaryField
{
    sides
    {
        type            zeroGradient;
    }
    frontBack
    {
        type            empty;
    }
}


// ************************************************************************* //
