run_cases/case07_acousticWaveSquareCylinder/0.orig/linearZone/boundaryFile
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class		IOobject;
    location    "0/linearZone";
    object      boundryFile;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

boundaryField
{
    "(sides|left|right|top|bottom)"
    {
    	type			zeroGradient;
    }
    
    frontBack
    {
        type            empty;
    }
}

// ************************************************************************* //
