run_cases/case07_acousticWaveSquareCylinder/system/linearZone/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/linearZone";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

spatialScheme		DRP7;

filterScheme		SFo9p 2e-1;

temporalScheme		LDDRK46;

interfaceInterpolation
{
	patches		(interfaceL interfaceR interfaceT interfaceB);
	order		4;
	relaxation	1e-2;
}

//nSubCycles			100; // x smaller than nonLinear dt

divSchemes
{
	default			Gauss linear;
}

gradSchemes
{
	default			Gauss linear;
}

laplacianSchemes
{
    default			Gauss linear uncorrected;
}

// ************************************************************************* //
